app/controllers/emails_controller.rb

  def index
    @emails = Email.all.sort_by(&:id)
---
SELECT "emails".* FROM "emails"

  def create
    @email = Email.create(object: Faker::Name.unique.name, body: Faker::ChuckNorris.fact, read: false)
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at", "read") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["object", "Benny Jenkins V"], ["body", "Chuck Norris's first program was kill -9."], ["created_at", "2021-11-24 15:41:16.491576"], ["updated_at", "2021-11-24 15:41:16.491576"], ["read", false]]

  def edit
    @email = Email.find(params[:id])
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 142], ["LIMIT", 1]]

  def update
    @email = Email.find(params[:id])
    @email.update(read: false)
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 164], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2021-11-25 13:56:25.282546"], ["id", 164]]