app/views/emails/create.js.erb


document.getElementById("email-list").insertAdjacentHTML("beforeend", "<%= j render 'email', email: @email %>")
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"