app/views/emails/show.js.erb


<% @email.update(read: true) %>
---
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2021-11-24 16:50:04.467101"], ["id", 154]]